# 다이아몬드로 장식
# 문자열 주의를 둘러 싼다
# .| .#.. | .#.. | .#.. | .#.. | .#..
# .| #.#. | #.#. | #.#. | #.#. | #.#.
# #| .A.# | .P.# | .P.# | .L.# | .E.#
# .| #.#. | #.#. | #.#. | #.#. | #.#.
# .| .#.. | .#.. | .#.. | .#.. | .#..
T = int(input())
for tc in range(1, T+1):
    result = 0
    text = list(input())
    arr = [['.'], ['.'], ['#'], ['.'], ['.']]
    for i in text:
        arr[0].extend('.#..')
        arr[1].extend('#.#.')
        arr[2].extend('.' + i + '.#')
        arr[3].extend('#.#.')
        arr[4].extend('.#..')

    for j in arr:
        print(''.join(j))
        # 이래로 출력하는 게 보기는 더 좋은데요? 물론 답은 틀리지만
        # print(*j)