'''
서로 다른 두수 a, b
X = a+1, b*2
Y = a*2, b+1

결국 짝수로 같은 값이 나온다

1개
X는 앞자리를 바꾸고 뒷자리를 짝수로
(홀, 홀) -> X -> (짝, 짝) 0
(홀, 짝) -> X -> (짝, 짝) 0
(짝, 짝) -> X -> (홀, 짝)
(짝, 홀) -> X -> (홀, 짝)

Y는 앞자리를 짝수로 뒷자리를 바꾸고
(홀, 홀) -> Y -> (짝, 짝) 0
(홀, 짝) -> Y -> (짝, 홀) 
(짝, 짝) -> Y -> (짝, 홀)
(짝, 홀) -> Y -> (짝, 짝) 0

2개
(홀, 홀) -> X -> (짝, 짝) -> X -> (홀, 짝)
(홀, 짝) -> X -> (짝, 짝) -> X -> (홀, 짝)
(짝, 짝) -> X -> (홀, 짝) -> X -> (짝, 짝) 0
(짝, 홀) -> X -> (홀, 짝) -> X -> (짝, 짝) 0

(홀, 홀) -> X -> (짝, 짝) -> Y -> (짝, 홀)
(홀, 짝) -> X -> (짝, 짝) -> Y -> (짝, 홀)
(짝, 짝) -> X -> (홀, 짝) -> Y -> (짝, 홀)
(짝, 홀) -> X -> (홀, 짝) -> Y -> (짝, 홀)

(홀, 홀) -> Y -> (짝, 짝) -> X -> (홀, 짝) 
(홀, 짝) -> Y -> (짝, 홀) -> X -> (홀, 짝) 
(짝, 짝) -> Y -> (짝, 홀) -> X -> (홀, 짝)
(짝, 홀) -> Y -> (짝, 짝) -> X -> (홀, 짝)

(홀, 홀) -> Y -> (짝, 짝) -> Y -> (짝, 홀)
(홀, 짝) -> Y -> (짝, 홀) -> Y -> (짝, 짝) 0
(짝, 짝) -> Y -> (짝, 홀) -> Y -> (짝, 짝) 0
(짝, 홀) -> Y -> (짝, 짝) -> Y -> (짝, 홀)

1. X 앞에는 무조건 (홀 , 0), Y 앞에는 무조건 (0, 홀)
2. XY나 YX로 끝나면 안됨
3. 무조건 XX, YY로 끝난다

(홀, 홀) -> X가 홀수개, Y가 홀수개,
(홀, 짝) -> Y가 짝수개
(짝, 짝) -> 
(짝, 홀) -> 



----------------------------------------------

a > b -> a-b = 0

a < b -> b-a = 0

-----------------------------------------------

15 - 7 => 8 (짝수) 
15 - 6 => 9 (홀수) 

-----------------------------------------------




'''